<h2>AiBD - laboratorium 3</h2>

<b>Łączenie z bazą danych i instrukcja select</b>

Norbert Sak, gr.2A

In [2]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

<b>1. Ile kategorii filmów mamy w wypożyczalni?</b>

In [4]:
df = pd.read_sql("SELECT DISTINCT COUNT(*) FROM category",con=connection_sqlalchemy)
df

   count
0     16

<b>2. Wyświetl listę kategorii w kolejności alfabetycznej.</b>

In [5]:
df = pd.read_sql("SELECT DISTINCT name FROM category ORDER BY name ASC",con=connection_sqlalchemy)
df

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

<b>3. Znajdź najstarszy i najmłodszy film do wypożyczenia.</b>
<br>Wszystkie filmy są z tego samego roku więc wyniki są takie same ponieważ filmy są po prostu wyświetlane alfabetycznie. Nie mniej jednak sama formuła jest jak najbardziej prawidłowa.

In [6]:
df = pd.read_sql("SELECT title FROM film ORDER BY release_year ASC LIMIT 1",con=connection_sqlalchemy)
df

             title
0  Chamber Italian

In [7]:
df = pd.read_sql("SELECT title FROM film ORDER BY release_year DESC LIMIT 1",con=connection_sqlalchemy)
df

             title
0  Chamber Italian

<b>4. Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?</b>

In [8]:
df = pd.read_sql("SELECT COUNT(*) FROM rental WHERE rental_date BETWEEN '2005-07-01' AND '2005-08-01'",con=connection_sqlalchemy)
df

   count
0   6709

<b>5. Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?</b>

In [9]:
df = pd.read_sql("SELECT COUNT(*) FROM rental WHERE rental_date BETWEEN '2010-01-01' AND '2011-02-01'",con=connection_sqlalchemy)
df

   count
0      0

<b>6. Znajdź największą płatność wypożyczenia.</b>

In [10]:
df = pd.read_sql("SELECT MAX(amount) FROM payment",con=connection_sqlalchemy)
df

     max
0  11.99

<b>7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.</b>

In [21]:
df = pd.read_sql("SELECT first_name, last_name, country FROM customer \
                LEFT JOIN address ON address.address_id = customer.address_id \
                LEFT JOIN city ON city.city_id = address.city_id \
                LEFT JOIN country ON country.country_id = city.country_id \
                WHERE country IN('Poland', 'Nigeria', 'Bangladesh')",con=connection_sqlalchemy)
df

   first_name  last_name     country
0       Sonia    Gregory     Nigeria
1       Brian      Wyman      Poland
2      Sidney   Burleson      Poland
3      Rodney    Moeller     Nigeria
4     Stephen     Qualls  Bangladesh
5       Velma      Lucas     Nigeria
6     Marilyn       Ross     Nigeria
7       Elsie     Kelley     Nigeria
8      Gladys   Hamilton     Nigeria
9       Frank   Waggoner  Bangladesh
10   Marjorie     Tucker      Poland
11      Carol     Garcia     Nigeria
12       Leah     Curtis      Poland
13      Ruben      Geary      Poland
14       Olga    Jimenez     Nigeria
15     Bertha   Ferguson     Nigeria
16     Tracey    Barrett     Nigeria
17         Jo     Fowler     Nigeria
18    Johnnie   Chisholm      Poland
19    Wallace      Slone     Nigeria
20   Michelle      Clark  Bangladesh
21    Russell    Brinson      Poland
22     Jimmie  Eggleston      Poland
23  Constance       Reid     Nigeria

<b>8. Gdzie mieszkają członkowie personelu?</b>

In [22]:
df = pd.read_sql("SELECT first_name, last_name, country, city, address FROM staff \
                LEFT JOIN address ON address.address_id = staff.address_id \
                LEFT JOIN city ON city.city_id = address.city_id \
                LEFT JOIN country ON country.country_id = city.country_id",con=connection_sqlalchemy)
df

  first_name last_name    country        city               address
0       Mike   Hillyer     Canada  Lethbridge     23 Workhaven Lane
1        Jon  Stephens  Australia   Woodridge  1411 Lillydale Drive

<b>9. Ilu pracowników mieszka w Argentynie lub Hiszpanii?</b>

In [24]:
df = pd.read_sql("SELECT COUNT(*) FROM staff \
                LEFT JOIN address ON address.address_id = staff.address_id \
                LEFT JOIN city ON city.city_id = address.city_id \
                LEFT JOIN country ON country.country_id = city.country_id \
                WHERE country IN('Spain', 'Argentina')",con=connection_sqlalchemy)
df

   count
0      0

<b>10. Jakie kategorie filmów zostały wypożyczone przez klientów?</b>

In [42]:
df = pd.read_sql("SELECT DISTINCT name FROM category \
                LEFT JOIN film_category ON film_category.category_id = category.category_id \
                LEFT JOIN film ON film.film_id = film_category.film_id \
                LEFT JOIN inventory ON inventory.film_id = film.film_id \
                LEFT JOIN rental ON rental.inventory_id = inventory.inventory_id \
                LEFT JOIN customer ON customer.customer_id = rental.customer_id",con=connection_sqlalchemy)
df

           name
0        Horror
1        Comedy
2         Drama
3        Sci-Fi
4       Foreign
5      Classics
6         Games
7        Travel
8           New
9         Music
10       Action
11  Documentary
12       Sports
13    Animation
14     Children
15       Family

<b>11. Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.</b>

In [54]:
df = pd.read_sql("SELECT DISTINCT name FROM category \
                LEFT JOIN film_category ON film_category.category_id = category.category_id \
                LEFT JOIN film ON film.film_id = film_category.film_id \
                LEFT JOIN inventory ON inventory.film_id = film.film_id \
                LEFT JOIN rental ON rental.inventory_id = inventory.inventory_id \
                LEFT JOIN payment ON payment.customer_id = rental.customer_id \
                LEFT JOIN staff ON staff.staff_id = payment.staff_id \
                LEFT JOIN store ON store.store_id = staff.store_id \
                LEFT JOIN address ON address.address_id = store.address_id \
                LEFT JOIN city ON city.city_id = address.city_id \
                LEFT JOIN country ON country.country_id = city.country_id \
                WHERE country IN('United States', 'Canada')",con=connection_sqlalchemy)
df

           name
0        Sci-Fi
1         Drama
2        Comedy
3        Horror
4      Classics
5       Foreign
6         Games
7           New
8        Travel
9         Music
10       Action
11  Documentary
12       Sports
13    Animation
14       Family
15     Children

<b>12. Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley</b>

In [59]:
df = pd.read_sql("SELECT title FROM film \
                LEFT JOIN film_actor ON film_actor.film_id = film.film_id \
                LEFT JOIN actor ON actor.actor_id = film_actor.actor_id \
                WHERE (first_name = 'Olympia' and last_name = 'Pfeiffer') or \
                (first_name = 'Julia' and last_name = 'Zellweger') or \
                (first_name = 'Ellen' and last_name = 'Presley')",con=connection_sqlalchemy)
df

                title
0     Bilko Anonymous
1   Caribbean Liberty
2    Casper Dragonfly
3    Empire Malkovich
4       Floats Garden
..                ...
64       Outlaw Hanky
65    Panky Submarine
66   Rider Caddyshack
67          Won Dares
68      Wyoming Storm

[69 rows x 1 columns]